src/Documents/РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам/РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам</name>
  <registerRecords>AccumulationRegister.РА_ПодсистемаРасчетаБонусовПартнеров_БонусыПартнерам</registerRecords>
  <attributes>
    <name>ДатаПриложенияКДоговору</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриложенияКДоговору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ПериодыДействияБонуса</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБонусовИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиоФинДира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставленыСтатДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияАвтоматическийРасчет</name>
    <attributes>
      <name>АналитикаНастройкиПремий</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ФорматыОтгрузки</types>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ВидыОборудованияДляНачисленияБонусов</types>
      </type>
    </attributes>
    <attributes>
      <name>БонусируемыйОборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонуснаяПрограмма</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполненияПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателяПлана</name>
      <type>
        <types>EnumRef.РА_ТипыПоказателяПлана</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПремии</name>
      <type>
        <types>EnumRef.РА_ТипыПремийПартнерам</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияРучнойРасчет</name>
    <attributes>
      <name>АналитикаНастройкиПремий</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ФорматыОтгрузки</types>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ВидыОборудованияДляНачисленияБонусов</types>
      </type>
    </attributes>
    <attributes>
      <name>БонуснаяПрограмма</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПремии</name>
      <type>
        <types>EnumRef.РА_ТипыПремийПартнерам</types>
      </type>
    </attributes>
    <attributes>
      <name>БонусируемыйОборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДействующихБонусныхПрограмм</name>
    <attributes>
      <name>БонуснаяПрограмма</name>
      <type>
        <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РА_ПодсистемаРасчетаБонусовПартнеров_НачислениеБонусовПартнерам/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Наименование <> ""Управленческая организация""";
		
		ЗапросОрганизация= Запрос.Выполнить().Выгрузить();
		
		Если ЗапросОрганизация.Количество() = 1 Тогда
			Объект.Организация = ЗапросОрганизация[0].Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Партнер) ИЛИ ЗначениеЗаполнено(Объект.Договор) Тогда
		ПолучитьДоступныеБонусныеПрограммы();	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИспользоватьПартнеровКакКонтрагентов              = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
	ИспользоватьНесколькоОрганизаций                  = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ФиоФинДира = "Тихонова Е.А.";	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредоставленыСтатДанныеПриИзменении(Элемент)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерБезКЛПриИзменении(Элемент)
	ПриИзмененииПартнераСервер();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();		
КонецПроцедуры

&НаКлиенте
Процедура ПериодДействияПриИзменении(Элемент)
	ПолучитьДоступныеБонусныеПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
		
	ПриИзмененииПартнераСервер();
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияРучнойРасчет

&НаКлиенте
Процедура НачисленияРучнойРасчетПроцентПремииПриИзменении(Элемент)
	ТекДанные = Элементы.НачисленияРучнойРасчет.ТекущиеДанные;
	ТекДанные.СуммаБонуса = ТекДанные.БонусируемыйОборот * ТекДанные.ПроцентПремии / 100;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияРучнойРасчетБонусируемыйОборотПриИзменении(Элемент)
	ТекДанные = Элементы.НачисленияРучнойРасчет.ТекущиеДанные;
	ТекДанные.СуммаБонуса = ТекДанные.БонусируемыйОборот * ТекДанные.ПроцентПремии / 100;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияРучнойРасчетСуммаБонусаПриИзменении(Элемент)
	ТекДанные = Элементы.НачисленияРучнойРасчет.ТекущиеДанные;
	ТекДанные.БонусируемыйОборот = ТекДанные.СуммаБонуса * 100 /ТекДанные.ПроцентПремии;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияРучнойРасчетПриИзменении1(Элемент)
	Объект.СуммаБонусовИтого = Объект.НачисленияАвтоматическийРасчет.Итог("СуммаБонуса") + Объект.НачисленияРучнойРасчет.Итог("СуммаБонуса");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВводНаОснованииПриобретениеУслугИПрочихАктивов(Команда)
	
	Если Модифицированность ИЛИ Не Объект.Проведен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не проведен!");
		Возврат;
	КонецЕсли;

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Основание", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ПриобретениеУслугПрочихАктивов.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	Объект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "Контрагент");
	ПолучитьДоступныеБонусныеПрограммы();
	Объект.НачисленияАвтоматическийРасчет.Очистить();
	Объект.СуммаБонусовИтого = Объект.НачисленияАвтоматическийРасчет.Итог("СуммаБонуса") + Объект.НачисленияРучнойРасчет.Итог("СуммаБонуса");	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьДоступныеБонусныеПрограммы()
    
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПолучитьДоступныеБонусныеПрограммы();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	СгенерироватьСпискиВыбораПоДействующимБонуснымПрограммам();
	
КонецПроцедуры	

&НаСервере
Процедура СгенерироватьСпискиВыбораПоДействующимБонуснымПрограммам()
	
	СписокВыбора = ПолучитьСписокВыбораПоРеквизиту("ПериодДействия");
	Элементы.ПериодДействия.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораПоРеквизиту(ИмяРеквизита)
	
	МассивЗначений = Новый Массив;
	
	Для Каждого СтрокаБонуснойПрограммы ИЗ Объект.ТаблицаДействующихБонусныхПрограмм Цикл
		МассивЗначений.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаБонуснойПрограммы.БонуснаяПрограмма, ИмяРеквизита));	
	КонецЦикла;
	
	МассивЗначений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗначений);
	
	СписокВыбора = Новый СписокЗначений;
	
	Для Каждого ЭлементМассива ИЗ МассивЗначений Цикл
		СписокВыбора.Добавить(ЭлементМассива);	
	КонецЦикла; 
	
	Возврат МассивЗначений;
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьДоговорПоУмолчанию()
	
	ВалютаВзаиморасчетовДляДоговора = Неопределено;
	
	//@skip-check wrong-string-literal-content
	ХозяйственнаяОперацияДоговора = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	
	Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(Объект, 
													   ХозяйственнаяОперацияДоговора, 
													   ВалютаВзаиморасчетовДляДоговора,
													   ,
													   Ложь);
	
	Если Договор <> Объект.Договор Тогда
		Объект.Договор = Договор;
	КонецЕсли;
	
	ПолучитьДоступныеБонусныеПрограммы();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПартнераСервер()
		
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	Если ИспользоватьДоговорыСКлиентами Тогда
		ЗаполнитьДоговорПоУмолчанию();
	КонецЕсли;
	
	ПолучитьДоступныеБонусныеПрограммы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьАвтоматическийРасчет();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры 

#КонецОбласти
